---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.NoSketchPlane
source: html/3def4273-99ce-5158-c8d0-293eb7c924b5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.NoSketchPlane Property

Can't paste because no Work Plane is defined in the View.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSketchPlane { get; }
```